-------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/lsh152058/Desktop/GitHub/ethnicity-short-
> data-report/logs/00_describe_snomed_ethnicity.log
  log type:  text
 opened on:   2 Sep 2021, 18:50:26

. 
. *create stata version of codelists for merging
. import delimited ./codelists/opensafely-ethnicity-uk-catego
> ries.csv, clear
(2 vars, 610 obs)

. format code %20.0f

. tostring code, gen(snomedcode) format(%20.0g)
snomedcode generated as str16

. save ./output/opensafely-ethnicity-uk-categories_formerge.d
> ta, replace
file ./output/opensafely-ethnicity-uk-categories_formerge.dta
>  saved

. 
. clear

. 
. *import csv for each group and save as dta
. forvalues i=1/10 {
  2.         cap import delimited ./output/input`i'.csv, clea
> r
  3.         save ./output/input`i'.dta, replace
  4. }
no variables defined
r(111);

end of do-file

r(111);

