-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/00_trim_snomed_codelist.log
  log type:  text
 opened on:   2 Sep 2021, 18:22:46

. 
. import delimited ./codelists/opensafely-ethnicity-uk-categories.csv, clear
(2 vars, 610 obs)

. save ./codelists/opensafely-ethnicity-uk-categories.dta, replace
file ./codelists/opensafely-ethnicity-uk-categories.dta saved

. 
. *gen groups of 50 codes
. tostring code, replace
code cannot be converted reversibly; no replace

. format code %20.0f

. gen group=[_n]

. replace group=group/61
(610 real changes made)

. replace group=ceil(group)
(600 real changes made)

. tab group

      group |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         61       10.00       10.00
          2 |         61       10.00       20.00
          3 |         61       10.00       30.00
          4 |         61       10.00       40.00
          5 |         61       10.00       50.00
          6 |         61       10.00       60.00
          7 |         61       10.00       70.00
          8 |         61       10.00       80.00
          9 |         61       10.00       90.00
         10 |         61       10.00      100.00
------------+-----------------------------------
      Total |        610      100.00

. 
.  preserve 

.  foreach i of num 1/10 {
  2.          keep if group == `i'
  3.                  drop group
  4.                  tostring code, replace
  5.          export delimited ./codelists/group`i'.csv, replace novarnames
  6.          restore, preserve 
  7.  }
(549 observations deleted)
code cannot be converted reversibly; no replace
(note: file ./codelists/group1.csv not found)
file ./codelists/group1.csv saved
(549 observations deleted)
code was double now str9
(note: file ./codelists/group2.csv not found)
file ./codelists/group2.csv saved
(549 observations deleted)
code was double now str9
(note: file ./codelists/group3.csv not found)
file ./codelists/group3.csv saved
(549 observations deleted)
code cannot be converted reversibly; no replace
(note: file ./codelists/group4.csv not found)
file ./codelists/group4.csv saved
(549 observations deleted)
code cannot be converted reversibly; no replace
(note: file ./codelists/group5.csv not found)
file ./codelists/group5.csv saved
(549 observations deleted)
code cannot be converted reversibly; no replace
(note: file ./codelists/group6.csv not found)
file ./codelists/group6.csv saved
(549 observations deleted)
code cannot be converted reversibly; no replace
(note: file ./codelists/group7.csv not found)
file ./codelists/group7.csv saved
(549 observations deleted)
code cannot be converted reversibly; no replace
(note: file ./codelists/group8.csv not found)
file ./codelists/group8.csv saved
(549 observations deleted)
code cannot be converted reversibly; no replace
(note: file ./codelists/group9.csv not found)
file ./codelists/group9.csv saved
(549 observations deleted)
code cannot be converted reversibly; no replace
(note: file ./codelists/group10.csv not found)
file ./codelists/group10.csv saved

. 
.  log close
      name:  <unnamed>
       log:  /workspace/logs/00_trim_snomed_codelist.log
  log type:  text
 closed on:   2 Sep 2021, 18:22:48
-------------------------------------------------------------------------------
